const About = () => {
    return (
        <div className="blurred-background">
            <div className="content-wrapper">
                <div className="container">
                    <h1>Про нас</h1>
                    <p>
                        Ми - "Квітковий Гай", ваш надійний партнер у світі квітів. Наш магазин працює на ринку вже понад 10 років, і за цей час ми встигли стати улюбленцями багатьох клієнтів. Ми постійно приносимо радість, створюючи свіжі та красиві букети для будь-якого випадку — від весіль до буденних сюрпризів. Наша команда складається з досвідчених флористів, які з любов’ю підходять до кожної композиції.
                    </p>
                    <p>
                        У нас ви знайдете широкий асортимент квітів: троянди, тюльпани, лілії, соняшники та багато іншого. Ми дбаємо про якість, тому співпрацюємо лише з перевіреними постачальниками. Кожен букет — це маленьке диво, яке ми створюємо для вас з душею. Також ми пропонуємо доставку по всьому місту, щоб ваші квіти дісталися до адресата в найкоротші терміни.
                    </p>
                    <div className="about-images">
                        <img src="/images/main1.png" alt="Main 1" />
                        <img src="/images/main2.png" alt="Main 2" />
                        <img src="/images/main3.png" alt="Main 3" />
                        <img src="/images/main4.png" alt="Main 4" />
                    </div>
                </div>
            </div>
        </div>
    );
};

export default About;